In [19]:
import pandas as pd

df = pd.read_csv('agegroup.csv')
print(df.head())

   ID        FullName  Gender DateOfBirth
0   1      Stan Smith    Male  1960-02-10
1   2  Nikola Griffin    Male  1999-12-20
2   3      Ruby Moore  Female  2002-03-03

In [20]:
print(df.columns)

Index(['ID', 'FullName', 'Gender', 'DateOfBirth'], dtype='object')

In [21]:
df['DateOfBirth'] = pd.to_datetime(df['DateOfBirth'])

In [26]:
df['Age'] = df['DateOfBirth'].apply(lambda x: (pd.datetime.now().year - x.year))
#df['Age'] = df['DateOfBirth'].apply(lambda x: (2018 - x.year))

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:1: FutureWarning: The pandas.datetime class is deprecated and will be removed from pandas in a future version. Import from datetime instead.
  """Entry point for launching an IPython kernel.

In [27]:
df

   ID        FullName  Gender DateOfBirth  Age AgeGroup
0   1      Stan Smith    Male  1960-02-10   60    Adult
1   2  Nikola Griffin    Male  1999-12-20   21    Adult
2   3      Ruby Moore  Female  2002-03-03   18     Teen

In [28]:
bins = [13, 19, 60, 100]
labels = ['Teen','Adult','Senior Adult']
df['AgeGroup'] = pd.cut(df['Age'], bins = bins, labels=labels, right=False)

In [29]:
df

   ID        FullName  Gender DateOfBirth  Age      AgeGroup
0   1      Stan Smith    Male  1960-02-10   60  Senior Adult
1   2  Nikola Griffin    Male  1999-12-20   21         Adult
2   3      Ruby Moore  Female  2002-03-03   18          Teen

In [32]:
df.drop(['Age'], axis =1)

   ID        FullName  Gender DateOfBirth      AgeGroup
0   1      Stan Smith    Male  1960-02-10  Senior Adult
1   2  Nikola Griffin    Male  1999-12-20         Adult
2   3      Ruby Moore  Female  2002-03-03          Teen